import sqlite3

conn = sqlite3.connect('торговая_фирма.db')
c = conn.cursor()

c.execute('''CREATE TABLE IF NOT EXISTS продажа_товаров (
    дата_продажи DATE,
    товар TEXT,
    сумма REAL,
    скидка INTEGER,
    филиал TEXT,
    менеджер TEXT
)''')

c.execute("INSERT INTO продажа_товаров (дата_продажи, товар, сумма, скидка, филиал, менеджер) VALUES (?, ?, ?, ?, ?, ?)",
          ('2024-03-08', 'Товар 1', 1000, 5, 'Филиал 1', 'Менеджер 1'))
c.execute("INSERT INTO продажа_товаров (дата_продажи, товар, сумма, скидка, филиал, менеджер) VALUES (?, ?, ?, ?, ?, ?)",
          ('2024-03-09', 'Товар 2', 1500, 10, 'Филиал 2', 'Менеджер 2'))
c.execute("INSERT INTO продажа_товаров (дата_продажи, товар, сумма, скидка, филиал, менеджер) VALUES (?, ?, ?, ?, ?, ?)",
          ('2024-03-10', 'Товар 3', 2000, 15, 'Филиал 3', 'Менеджер 3'))

conn.commit()

conn.close()